kasia-breakup/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jay Dixit" />
<link rel='stylesheet' type='text/css' href='../css/iphone.css ' />
</head>
<body>
<div id="content">
<p>
hey just checking in on ya. drinks tonight/tomo?
</p>

<ul class="org-ul">
<li>Hi hi! Can we do something post holidays? I have an opposition due dec. 29 :/</li>
<li>Which I want to finish before Christmas, so I can go home.</li>
</ul>

<p>
wow, good luck with that. I&rsquo;m sure you&rsquo;ll make it amazing.
</p>

<p>
not sure where your head is at re us. for now I&rsquo;ll assume we&rsquo;re not together, but if you want to revisit after the holidays I would love to see you.
</p>

<ul class="org-ul">
<li>Yeah I wanted to talk. I&rsquo;m sorry it hasn&rsquo;t worked out.</li>
<li>I want to see you</li>
<li>I have felt really good and calm over the last 6 ish weeks</li>
</ul>

<p>
that&rsquo;s great, I&rsquo;m so glad 
</p>

<p>
that you&rsquo;ve felt that way 
</p>

<p>
I want to see you too 
</p>

<p>
I&rsquo;ve missed you 
</p>

<p>
it seems like maybe now isn&rsquo;t the right time for you 
</p>

<ul class="org-ul">
<li>I have missed you too and spent a lot of time thinking about you.</li>
</ul>

<p>
I know 
</p>

<p>
but there&rsquo;s a difference between having feelings for someone and being ready to be with them 
</p>

<ul class="org-ul">
<li>I know.</li>
</ul>

<p>
I want to be with you but only if you want to be with me 
</p>

<p>
and only when you&rsquo;re ready to really be in it 
</p>

<p>
there are so many things I appreciate about you
</p>

<p>
someday I would love to tell you what they are 
</p>

<p>
I still have your contact lenses on my nightstand and your pen in my medicine cabinet
</p>

<p>
but I&rsquo;m not going to just wait around for you 
</p>

<p>
how are you thinking about all this? 
</p>

<ul class="org-ul">
<li>Well, I think this is an in-person conversation. But I don&rsquo;t want or expect you to wait around for me.</li>
<li>And I&rsquo;m sad that that&rsquo;s where I am right now, because I think you are really great.</li>
<li>I also feel like I was never really my best to or with you, because of some sort of hesitation</li>
<li>So while its nice to read that you appreciate so many things about me, my first response is, how can that be? Since I don&rsquo;t love who I was during that time</li>
<li>A little on edge, stressy, ugh. I am sorry.</li>
</ul>

<p>
I know, I felt that hesitation too 
</p>

<ul class="org-ul">
<li>I appreciate many things about YOU.</li>
</ul>

<p>
well when I see you I&rsquo;ll tell you all the things about you and give you time to cross-examine 
</p>

<p>
but they are the things that came through even when you were stressed out 
</p>

<ul class="org-ul">
<li>I felt like I didn&rsquo;t laugh at things I would normally laugh at.</li>
<li>Like, I think about things that I didn&rsquo;t laugh at and think, wait, that&rsquo;s funny, and ordinarily I would laugh at that!</li>
<li>I was bottled up though and it made me not as good</li>
</ul>

<p>
wow
</p>

<p>
then I would love to see you at your best  
</p>

<ul class="org-ul">
<li>I was just so caged and not open and I think it must have been hard for you.</li>
<li>When you are like that emotionally I think it seeps into everything, like laughter</li>
<li>Anyway, I am going to bed</li>
<li>But let&rsquo;s get together in 2016.</li>
</ul>

<p>
yes, let&rsquo;s 
</p>

<p>
and if at some point you&rsquo;re ready to be with me and be fully present in the relationship, you know I&rsquo;m up for it
</p>

<p>
goodnight rainchaser 
</p>
</div>
</body>
</html>